examples/lid_driven_cavity/setup_files/openfoam_esi2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     coconut_pimpleFoam;

//solver          incompressibleFluid;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         1e15;

deltaT          0.01;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      fixed;

timePrecision   3;

runTimeModifiable false;

adjustTimeStep  no;


// ************************************************************************* //
